--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/bubbles/Desktop/Super and Housing/dofiles/housing_describe.log
  log type:  text
 opened on:  31 May 2023, 09:09:14

. 
. 
. global folder_path "/Users/bubbles/Desktop/Hilda" 

. 
. global data_output "$folder_path/output"

. 
. use "$data_output/housing_variables", clear 

. 
. compress
  variable wave was float now byte
  (1,299,345 bytes saved)

. 
. xtset id wave //set as panel 

Panel variable: id (unbalanced)
 Time variable: wave, 1 to 21, but with gaps
         Delta: 1 unit

. 
. by id (wave), sort: keep if hgage[1] >= 50 & !missing(hgage[1]) 
(346,438 observations deleted)

. 
end of do-file

. tab hstenr if wave ==1

       R3 Own, Rent or live rent free |      Freq.     Percent        Cum.
--------------------------------------+-----------------------------------
[1] Own/currently paying off mortgage |      4,283       83.55       83.55
              [2] Rent (or pay board) |        689       13.44       97.00
    [3] Involved in a rent-buy scheme |        154        3.00      100.00
--------------------------------------+-----------------------------------
                                Total |      5,126      100.00

. clear 

. gen id = 5

. tab id
no observations

. help mod 

