---------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/bubbles/Desktop/Retirement_Income/dofile/housing_describe.log
  log type:  text
 opened on:  19 Jul 2023, 17:53:09

. 
. 
. global folder_path "/Users/bubbles/Desktop/Hilda" 

. 
. global data_output "$folder_path/output"

. 
. use "$data_output/combined", clear 

. 
. compress
  variable wave was float now byte
  (1,299,345 bytes saved)

. 
. xtset id wave //set as panel 

Panel variable: id (unbalanced)
 Time variable: wave, 1 to 21, but with gaps
         Delta: 1 unit

. 
. by id (wave), sort: keep if hgage[1] >= 55 & !missing(hgage[1]) 
(370,428 observations deleted)

. 
. by id (wave), sort: keep if hstenr[1] == 1 //keep initial owners
(23,048 observations deleted)

. 
. 
. 
. //simple version where just looks at the first outcome when the first ownership spell ends (end if move address), and see what that outcome
>  is 
. 
. //the main point is to generate a dataset that has id, failure (the final outcome when change happened) and failtime (when this change happ
> ened) 
. //something who dropped after 3 waves and someone who dropped out after 20 waves both count as attrition but at different times. 
. 
. sort id wave 

. 
. by id: gen flag=1 if missing(hstenr) | (missing(mhli) & _n!=1)  //drop waves after a key variable becomes missing
(38,110 missing values generated)

. by id : replace flag=flag[_n-1] if flag[_n-1]==1
(1,026 real changes made)

. drop if flag==1 
(2,555 observations deleted)

. drop flag 

. 
. by id: gen change=1 if (hstenr[_n] != hstenr[_n-1]) & _n!=1 & !missing(hstenr) & !missing(hstenr[_n-1]) //change ownership status (in princ
> ipal can live in the same place)
(35,919 missing values generated)

. replace change =1 if mhli==1 //change address 
(998 real changes made)

. by id: egen failtime= min(cond(change == 1, wave, .)) //record the first time change turned 1 
(21,011 missing values generated)

. by id: egen failure = min(cond(wave == failtime, hstenr, .))
(21,011 missing values generated)

. 
. /*
> by id: gen flag =1 if change ==1 //drop the periods after the first time 
> by id: replace flag = flag[_n-1] if flag[_n-1] ==1 
> drop if flag ==1 
> 
> */ 
. by id: replace failure = 0 if missing(failure) // attrition 
(21,011 real changes made)

. by id: replace failtime = _N if missing(failtime) //record period attrition happened. 
(21,011 real changes made)

. 
. //describe 
. label define outcomes 0 "0 attrition" 1 "1 ownership" 2 "2 rent" 3 "3 rent-buy scheme" 4 "4 rent free"

. label values failure outcomes

. tab failure if wave==1 //this shows what happens to those initial owners (after the end of the first ownership spell)

          failure |      Freq.     Percent        Cum.
------------------+-----------------------------------
      0 attrition |      2,215       68.22       68.22
      1 ownership |        659       20.30       88.51
           2 rent |        233        7.18       95.69
3 rent-buy scheme |          7        0.22       95.90
      4 rent free |        133        4.10      100.00
------------------+-----------------------------------
            Total |      3,247      100.00

. 
. 
. //use change in residency, and divide into upgrade downgrade and similar 
. 
. sort id wave 

. 
. by id: gen change=1 if mhli==1 | (mhli==. & _n!=1) //changed address or missing (both serve as a reason for a wave to be last wave)
variable change already defined
r(110);

end of do-file

r(110);

